RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_mcwdt_b.c
    Cy_MCWDT_Lock(base);

}

/*******************************************************************************
* Function Name: Cy_MCWDT_ClearWatchdog
****************************************************************************//**
*
* Clears the MC watchdog counter, to prevent a XRES device reset or fault.
*
*  \param base
*  The base pointer to a structure that describes the registers.
*
*  \param counters
*  OR of all counters to clear watchdog. See the \ref CY_MCWDT_CTR0, CY_MCWDT_CTR1, and
*  CY_MCWDT_CTR2  macros.
*
*******************************************************************************/
void Cy_MCWDT_ClearWatchdog(MCWDT_Type *base, uint32_t counters)
{
    Cy_MCWDT_Unlock(base);
    Cy_MCWDT_ResetCounters(base, counters, 0u);
    Cy_MCWDT_Lock(base);
}


/*******************************************************************************
* Function Name: Cy_MCWDT_CpuSelectForDpSlpPauseAction
****************************************************************************//**
*
*  Select deep sleep of which core for pausing this counter
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param core
*  The selected core. Deep sleep of the core pause this counter.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_MCWDT_CpuSelectForDpSlpPauseAction(MCWDT_Type *base, cy_en_mcwdt_select_core_t core)
{
    MCWDT_CPU_SELECT(base) = _CLR_SET_FLD32U(MCWDT_CPU_SELECT(base), MCWDT_CPU_SELECT_CPU_SEL, core);
}

/*******************************************************************************
* Function Name: Cy_MCWDT_SetLowerAction
****************************************************************************//**
*
*  Sets the lower limit action of the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-1].
*
*  \param action
*  The action of operation for the counter. See enum typedef cy_en_mcwdt_lower_upper_action_t.
*
*  \note
*  This API must not be called while the counters are running.
*  Prior to calling this API, the counter must be disabled.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_MCWDT_SetLowerAction(MCWDT_Type *base, cy_en_mcwdtctr_t counter, cy_en_mcwdt_lower_upper_action_t action)
{
    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0) = _CLR_SET_FLD32U(MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0), MCWDT_CTR_CONFIG_LOWER_ACTION, action);
        break;
    case CY_MCWDT_COUNTER1:
        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1) = _CLR_SET_FLD32U(MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1), MCWDT_CTR_CONFIG_LOWER_ACTION, action);
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_MCWDT_SetUpperAction
****************************************************************************//**
*
*  Sets the upper limit action of the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-1].
*
*  \param action
*  The action of operation for the counter. See enum typedef cy_en_mcwdt_lower_upper_action_t.
*
*  \note
*  This API must not be called while the counters are running.
*  Prior to calling this API, the counter must be disabled.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_MCWDT_SetUpperAction(MCWDT_Type *base, cy_en_mcwdtctr_t counter, cy_en_mcwdt_lower_upper_action_t action)
{
    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0) = _CLR_SET_FLD32U(MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0), MCWDT_CTR_CONFIG_UPPER_ACTION, action);
        break;
    case CY_MCWDT_COUNTER1:
        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1) = _CLR_SET_FLD32U(MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1), MCWDT_CTR_CONFIG_UPPER_ACTION, action);
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_MCWDT_SetUpperAction
****************************************************************************//**
*
*  Sets the warn limit action of the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-1].
*
*  \param action
*  The action of operation for the counter. See enum typedef cy_en_mcwdt_warn_action_t.
*
*  \note
*  This API must not be called while the counters are running.
*  Prior to calling this API, the counter must be disabled.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_MCWDT_SetWarnAction(MCWDT_Type *base, cy_en_mcwdtctr_t counter, cy_en_mcwdt_warn_action_t action)
{
    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0) = _CLR_SET_FLD32U(MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0), MCWDT_CTR_CONFIG_WARN_ACTION, action);
        break;
    case CY_MCWDT_COUNTER1:
        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1) = _CLR_SET_FLD32U(MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1), MCWDT_CTR_CONFIG_WARN_ACTION, action);
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }
}

/*******************************************************************************
* Function Name: Cy_MCWDT_SetSubCounter2Action
****************************************************************************//**
*
*  Sets the counter 2 action of the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param action
*  The action of operation for the counter. See enum typedef cy_en_mcwdt_cnt2_action_t.
*
*  \note
*  This API must not be called while the counters are running.
*  Prior to calling this API, the counter must be disabled.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_MCWDT_SetSubCounter2Action(MCWDT_Type *base, cy_en_mcwdt_cnt2_action_t action)
{
    MCWDT_CTR2_CONFIG(base) = _CLR_SET_FLD32U(MCWDT_CTR2_CONFIG(base), MCWDT_CTR2_CONFIG_ACTION, action);
}

