RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_mcwdt_b.c
/*******************************************************************************
* Function Name: Cy_MCWDT_SetLowerLimit
****************************************************************************//**
*
*  Sets the lower limit value for the specified counter (0 or 1).
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*   The number of the WDT counter. The valid range is [0-1].
*
*  \param limit
*  The value to lower limit against the counter.
*  The valid range is [0-65535] when Auto service is disabled and [1-65535] when
*  Auto service enabled.
*
*  \note
*  The lower limit value is not supported by Counter 2.
*
*  \note
*  Action on lower limit is taken on the next increment after the counter value
*  equal to lower limit value.
*
*  \param waitUs
*  The function waits for some delay in microseconds before returning,
*  because the match affects after two lf_clk cycles pass. The recommended
*  value is 93 us.
*  \note
*  Setting this parameter to a zero means No wait. This must be taken
*  into account when changing the match values on the running counters.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_MCWDT_SetLowerLimit(MCWDT_Type *base, cy_en_mcwdtctr_t counter, uint16_t limit, uint16_t waitUs)
{
    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        MCWDT_CTR_LOWER_LIMIT(base, CY_MCWDT_COUNTER0) = _CLR_SET_FLD32U(MCWDT_CTR_LOWER_LIMIT(base, CY_MCWDT_COUNTER0), MCWDT_CTR_LOWER_LIMIT_LOWER_LIMIT, limit);
        break;
    case CY_MCWDT_COUNTER1:
        MCWDT_CTR_LOWER_LIMIT(base, CY_MCWDT_COUNTER1) = _CLR_SET_FLD32U(MCWDT_CTR_LOWER_LIMIT(base, CY_MCWDT_COUNTER1), MCWDT_CTR_LOWER_LIMIT_LOWER_LIMIT, limit);
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }
    Cy_SysLib_DelayUs(waitUs);
}

/*******************************************************************************
* Function Name: Cy_MCWDT_SetUpperLimit
****************************************************************************//**
*
*  Sets the upper limit value for the specified counter (0 or 1).
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*   The number of the WDT counter. The valid range is [0-1].
*
*  \param limit
*  The value to upper limit against the counter.
*  The valid range is [0-65535] when Auto service is disabled and [1-65535] when
*  Auto service enabled.
*
*  \note
*  The upper limit value is not supported by Counter 2.
*
*  \note
*  Action on upper limit is taken on the next increment after the counter value
*  equal to upper limit value.
*
*  \param waitUs
*  The function waits for some delay in microseconds before returning,
*  because the match affects after two lf_clk cycles pass. The recommended
*  value is 93 us.
*  \note
*  Setting this parameter to a zero means No wait. This must be taken
*  into account when changing the match values on the running counters.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_MCWDT_SetUpperLimit(MCWDT_Type *base, cy_en_mcwdtctr_t counter, uint16_t limit, uint16_t waitUs)
{
    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        MCWDT_CTR_UPPER_LIMIT(base, CY_MCWDT_COUNTER0) = _CLR_SET_FLD32U(MCWDT_CTR_UPPER_LIMIT(base, CY_MCWDT_COUNTER0), MCWDT_CTR_UPPER_LIMIT_UPPER_LIMIT, limit);
        break;
    case CY_MCWDT_COUNTER1:
        MCWDT_CTR_UPPER_LIMIT(base, CY_MCWDT_COUNTER1) = _CLR_SET_FLD32U(MCWDT_CTR_UPPER_LIMIT(base, CY_MCWDT_COUNTER1), MCWDT_CTR_UPPER_LIMIT_UPPER_LIMIT, limit);
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }
    Cy_SysLib_DelayUs(waitUs);
}

/*******************************************************************************
* Function Name: Cy_MCWDT_SetWarnLimit
****************************************************************************//**
*
*  Sets the warn limit value for the specified counter (0 or 1).
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*   The number of the WDT counter. The valid range is [0-1].
*
*  \param limit
*  The value to warn limit against the counter.
*  The valid range is [0-65535] when Auto service is disabled and [1-65535] when
*  Auto service enabled.
*
*  \note
*  The warn limit value is not supported by Counter 2.
*
*  \note
*  Action on warn limit is taken on the next increment after the counter value
*  equal to warn limit value.
*
*  \param waitUs
*  The function waits for some delay in microseconds before returning,
*  because the match affects after two lf_clk cycles pass. The recommended
*  value is 93 us.
*  \note
*  Setting this parameter to a zero means No wait. This must be taken
*  into account when changing the match values on the running counters.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_MCWDT_SetWarnLimit(MCWDT_Type *base, cy_en_mcwdtctr_t counter, uint16_t limit, uint16_t waitUs)
{
    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        MCWDT_CTR_WARN_LIMIT(base, CY_MCWDT_COUNTER0) = _CLR_SET_FLD32U(MCWDT_CTR_WARN_LIMIT(base, CY_MCWDT_COUNTER0), MCWDT_CTR_WARN_LIMIT_WARN_LIMIT, limit);
        break;
    case CY_MCWDT_COUNTER1:
        MCWDT_CTR_WARN_LIMIT(base, CY_MCWDT_COUNTER1) = _CLR_SET_FLD32U(MCWDT_CTR_WARN_LIMIT(base, CY_MCWDT_COUNTER1), MCWDT_CTR_WARN_LIMIT_WARN_LIMIT, limit);
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }
    Cy_SysLib_DelayUs(waitUs);
}

/*******************************************************************************
* Function Name: Cy_MCWDT_GetLowerLimit
****************************************************************************//**
*
*  Reports the lower limit comparison value for the specified counter (0 or 1).
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-1].
*
*  \note
*  The lower limit value is not supported by Counter 2.
*
*  \return
*  A 16-bit lower limit value.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
uint16_t Cy_MCWDT_GetLowerLimit(MCWDT_Type *base, cy_en_mcwdtctr_t counter)
{
    uint16_t retVal = 0u;

    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        retVal = (uint16_t)(_FLD2VAL(MCWDT_CTR_LOWER_LIMIT_LOWER_LIMIT, MCWDT_CTR_LOWER_LIMIT(base, CY_MCWDT_COUNTER0)));
        break;
    case CY_MCWDT_COUNTER1:
        retVal = (uint16_t)(_FLD2VAL(MCWDT_CTR_LOWER_LIMIT_LOWER_LIMIT, MCWDT_CTR_LOWER_LIMIT(base, CY_MCWDT_COUNTER1)));
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }

    return retVal;/* Control shouldn't reach here, fixes IAR compilation warning */
}

