RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_mcwdt_b.c
/*******************************************************************************
* Function Name: Cy_MCWDT_GetUpperLimit
****************************************************************************//**
*
*  Reports the upper limit comparison value for the specified counter (0 or 1).
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-1].
*
*  \note
*  The upper limit value is not supported by Counter 2.
*
*  \return
*  A 16-bit upper limit value.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
uint16_t Cy_MCWDT_GetUpperLimit(MCWDT_Type *base, cy_en_mcwdtctr_t counter)
{
    uint16_t retVal = 0u;

    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        retVal = (uint16_t)(_FLD2VAL(MCWDT_CTR_UPPER_LIMIT_UPPER_LIMIT, MCWDT_CTR_UPPER_LIMIT(base, CY_MCWDT_COUNTER0)));
        break;
    case CY_MCWDT_COUNTER1:
        retVal = (uint16_t)(_FLD2VAL(MCWDT_CTR_UPPER_LIMIT_UPPER_LIMIT, MCWDT_CTR_UPPER_LIMIT(base, CY_MCWDT_COUNTER1)));
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }

    return retVal;/* Control shouldn't reach here, fixes IAR compilation warning */
}

/*******************************************************************************
* Function Name: Cy_MCWDT_GetWarnLimit
****************************************************************************//**
*
*  Reports the warn limit comparison value for the specified counter (0 or 1).
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-1].
*
*  \note
*  The warn limit value is not supported by Counter 2.
*
*  \return
*  A 16-bit warn limit value.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
uint16_t Cy_MCWDT_GetWarnLimit(MCWDT_Type *base, cy_en_mcwdtctr_t counter)
{
    uint16_t retVal = 0u;

    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        retVal = (uint16_t)(_FLD2VAL(MCWDT_CTR_WARN_LIMIT_WARN_LIMIT, MCWDT_CTR_WARN_LIMIT(base, CY_MCWDT_COUNTER0)));
        break;
    case CY_MCWDT_COUNTER1:
        retVal = (uint16_t)(_FLD2VAL(MCWDT_CTR_WARN_LIMIT_WARN_LIMIT, MCWDT_CTR_WARN_LIMIT(base, CY_MCWDT_COUNTER1)));
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }

    return retVal;/* Control shouldn't reach here, fixes IAR compilation warning */
}

/*******************************************************************************
* Function Name: Cy_MCWDT_WaitForCounterReset
****************************************************************************//**
*
*  wait completion of counter reset.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the MCWDT counter. The valid range is [0-1].
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_MCWDT_WaitForCounterReset(MCWDT_Type *base, cy_en_mcwdtctr_t counter)
{
    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
    {
        while((_FLD2VAL(MCWDT_SERVICE_CTR0_SERVICE, MCWDT_SERVICE(base))) != 0UL)
        {
        }
        break;
    }
    case CY_MCWDT_COUNTER1:
    {
        while((_FLD2VAL(MCWDT_SERVICE_CTR1_SERVICE, MCWDT_SERVICE(base))) != 0UL)
        {
        }
        break;
    }
    case CY_MCWDT_COUNTER2:
    default:
        CY_ASSERT(0u != 0u);
        break;
    }
}


#if defined(__cplusplus)
}
#endif

#endif /* (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3) */

/* [] END OF FILE */
